export const works = [
    {
        "id": 1,
        "name": "<p class=\"text-center\">GMC RP</p><p class=\"text-center\">運営</p>",
        "each": "<span>GMC RP</span> <span>新商品申請フォーム</span>",
        "url": "https://www.gmcrp.net/",
        "url_name": "gmcrp.net",
        "purpose": "GTA5というゲームのサーバー用ウェブアプリケーションです。\r\nGTA5のサーバーの運営をしており、そこで使えるウェブアプリがあると便利だと思い作成しました。",
        "outlook": "このサービスは25,000$の売り上げを出しているということもありこれまでで1番本気で取り組んだ制作です。売り上げを出したという経験がこれからどんな制作をする際にも役に立つと思っています。",
        "device": {
            "1": "これまででも一番規模の大きい4000人に対して公開するウェブアプリになり、脆弱性の観点がとても難しかったです。ですが、「安全なWebアプリケーションの作り方」という本を見ながらコードを書くことでこれまでで一番の出来となるウェブアプリを作ることができました。",
            "2": "実際にアクセスしていただくとわかりますが、市民一覧のページには登録された方が設定したプロフィールを見れるようになっています。登録されているユーザ数は9/6の時点で1300人を超えており多くの情報があるため特定の市民について知りたい時によく使用されています。",
            "3": "プロフィールの細かく書くところにはmarked.jsというjavascriptライブラリを使用しました。marked.jsを導入する時には脆弱性であるXSSを「sanitize-html」というライブラリを使用して対策しました。他にもプロフィールの更新と作成の切り替えなどが苦労した点です。",
            "4": "このウェブアプリはゲーム内で使うようなルールや仕事の一覧などの情報を全てまとめています。全ての情報をなるべく見つけやすいようにヘッダーとフッターからアクセスできるようにしています。また、ページの中でタブを切り替えるとurlのidが変わるようにしurl共有もしやすくしています。",
            "5": "このウェブアプリにはスタッフ用コントロールパネルを実装しています。各ページを詳細にカスタマイズできるようにし、更新したいページが出てきた時にスタッフが更新できる仕組みになっています。この機能を導入したことでウェブアプリの開発者が手を加えなくても更新ができるので1番大きな機能だと感じています。"
        }
    },
    {
        "id": 2,
        "name": "<p class=\"text-center\">男木島メタバース</p><p class=\"text-center\"><span>コンテンツ</span><span>アイデアソン</span></p>",
        "each": "<span>男木島メタバース</span><span>コンテンツ</span><span>アイデアソン</span>",
        "url": "https://www.canva.com/design/DAF2ueSXvjE/EKkSm1QrsPgnWiXC1Ti2Ig/edit?utm_content=DAF2ueSXvjE&utm_campaign=designshare&utm_medium=link2&utm_source=sharebutton",
        "url_name": "発表時に使用したスライド資料",
        "purpose": "高校の課外活動としてありプロジェクトNの特別版で興味のあるメタバースという分野の活動だったため参加しました。メタバースを活用して男木島の関係人口を増やすための企画を考えスライドを作成しプレゼンテーションをしました。",
        "outlook": "NTTさんとケノヒさんという企業の協力のもと企画を考え、その企業さんに対してプレゼンテーションをしたためほぼ実践の形で企画制作能力とスライド制作能力、プレゼンテーション能力が育まれました。",
        "device": {
            "1": "この活動は【関係人口を増やす】【メタバースを活用する】【実現可能性を考える】という難しい内容でした。そのためペルソナからニーズを考える方法を取ったりマンダラート法を使ったりし企画を考案し、定義した課題を解決できる企画ができました。",
            "2": "僕たちのチームでは「メタエデュバース」というメタバース上の家庭教師をするというメタバースの特徴を最大限に活用した企画を考えました。3,4,5枚目の画像で工夫点を記載していますがさらに詳しいスライド資料は画面上部のリンクからご覧いただけます。",
            "3": "企画考案の段階で島の方に話を聞いてみたところ島に高校がない影響で島に高校生がいないという課題があることに気づきました。その課題から高校生と男木島の小中学生が触れ合えるというコンセプトに決定し企画を考えました。",
            "4": "他オンライン家庭教師について調べてみたところ飽きてしまうことが課題だとわかり画像のような飽きないための工夫を施しました。また、この課外活動の目的である関係人口として島に来てもらうために小中学生にリアルであってもらう工夫も施しています。",
            "5": "この活動はIT技術を活用して社会課題を解決するアイデアを考案するという内容であり、貴校のウェブサイトに載ってある使命にピッタリなことをしてきたなと感じました。"
        }
    },
    {
        "id": 3,
        "name": "<p class=\"text-center\">プロジェクトN</p><p class=\"text-center\"><span>クロスカルチャー</span><span>リデザイン</span></p>",
        "each": "<span>クロスカルチャー</span><span>リデザイン</span>",
        "url": "https://www.canva.com/design/DAFzuaRNJok/_qtR5d3suqUwaB0WF0VOPw/edit?utm_content=DAFzuaRNJok&utm_campaign=designshare&utm_medium=link2&utm_source=sharebutton",
        "url_name": "発表時に使用したスライド資料",
        "purpose": "高校の授業である「プロジェクトN」の活動で制作したものです。多文化共生への配慮が乏しい場所を様々な文化を持つ人にとって使いやすい場所にリデザインするという活動目標で行いました。",
        "outlook": "この活動時、自分のキャンパスの参加人数が少なかったため他キャンパスと合同でzoomを通して行った企画でした。そのためこれから必要になってくると感じているオンラインでの企画制作能力が特に養われました。",
        "device": {
            "1": "この活動は最終発表時に西日本ブロックで1番評価の高かったものになりました。そのため2年間(1年生~2年生)で1番力を入れたプロジェクトN制作だったと感じています。最後まで軸をブラさずに制作を行ってきたことが1番大きい要因だと感じています。",
            "2": "",
            "3": "この制作は少し特殊で軸から考えてみると課題が3つ出てきました。制作時はその3つの課題を常に考えていないとコンセプトに合っている企画を考えれないと感じました。そのため、課題から何をするかを常に考えるようにし、一貫性のある企画を考案することができました。",
            "4": "また、実現可能性という点も考えなければならない企画だったため5W1Hではなく6W3H(What, Who, Whom, Where, When, Why, How, How much, How many)の考え方を重視しました。スライドの全体を通して6W3Hを順番に潰していくようにし発表を見た人の疑問をゼロにする工夫を施しました。",
            "5": "自分自身はチームの中でもスライド制作に力を入れました。大きくわかりやすいスライドにするのはもちろんのこと、細かいグラフも元のスクリーンショットではなく一から作成し、統一感を持たせるよう意識しました。また、引用元もあまり目がいかないぐらいの大きさで記載し情報リテラシー面も完璧にしました。"
        }
    },
    {
        "id": 4,
        "name": "<p class=\"text-center\">GMC RP</p><p class=\"text-center\"><span>市民</span><span>プロフィール</span></p>",
        "each": "<span>GMC RP</span> <span>新商品申請フォーム</span>",
        "url": "https://www.gmcrp.net/",
        "url_name": "gmcrp.net",
        "purpose": "GTA5というゲームのサーバー用ウェブアプリケーションです。\r\nGTA5のサーバーの運営をしており、そこで使えるウェブアプリがあると便利だと思い作成しました。",
        "outlook": "このサービスは25,000$の売り上げを出しているということもありこれまでで1番本気で取り組んだ制作です。売り上げを出したという経験がこれからどんな制作をする際にも役に立つと思っています。",
        "device": {
            "1": "これまででも一番規模の大きい4000人に対して公開するウェブアプリになり、脆弱性の観点がとても難しかったです。ですが、「安全なWebアプリケーションの作り方」という本を見ながらコードを書くことでこれまでで一番の出来となるウェブアプリを作ることができました。",
            "2": "実際にアクセスしていただくとわかりますが、市民一覧のページには登録された方が設定したプロフィールを見れるようになっています。登録されているユーザ数は9/6の時点で1300人を超えており多くの情報があるため特定の市民について知りたい時によく使用されています。",
            "3": "プロフィールの細かく書くところにはmarked.jsというjavascriptライブラリを使用しました。marked.jsを導入する時には脆弱性であるXSSを「sanitize-html」というライブラリを使用して対策しました。他にもプロフィールの更新と作成の切り替えなどが苦労した点です。",
            "4": "このウェブアプリはゲーム内で使うようなルールや仕事の一覧などの情報を全てまとめています。全ての情報をなるべく見つけやすいようにヘッダーとフッターからアクセスできるようにしています。また、ページの中でタブを切り替えるとurlのidが変わるようにしurl共有もしやすくしています。",
            "5": "このウェブアプリにはスタッフ用コントロールパネルを実装しています。各ページを詳細にカスタマイズできるようにし、更新したいページが出てきた時にスタッフが更新できる仕組みになっています。この機能を導入したことでウェブアプリの開発者が手を加えなくても更新ができるので1番大きな機能だと感じています。"
        }
    },
    {
        "id": 5,
        "name": "<p class=\"text-center\">GMC RP</p><p class=\"text-center\">新商品申請フォーム</p>",
        "each": "<span>GMC RP</span> <span>新商品申請フォーム</span>",
        "url": "https://www.gmcrp.net/",
        "url_name": "gmcrp.net",
        "purpose": "GTA5というゲームのサーバー用ウェブアプリケーションです。\r\nGTA5のサーバーの運営をしており、そこで使えるウェブアプリがあると便利だと思い作成しました。",
        "outlook": "このサービスは25,000$の売り上げを出しているということもありこれまでで1番本気で取り組んだ制作です。売り上げを出したという経験がこれからどんな制作をする際にも役に立つと思っています。",
        "device": {
            "1": "これまででも一番規模の大きい4000人に対して公開するウェブアプリになり、脆弱性の観点がとても難しかったです。ですが、「安全なWebアプリケーションの作り方」という本を見ながらコードを書くことでこれまでで一番の出来となるウェブアプリを作ることができました。",
            "2": "実際にアクセスしていただくとわかりますが、市民一覧のページには登録された方が設定したプロフィールを見れるようになっています。登録されているユーザ数は9/6の時点で1300人を超えており多くの情報があるため特定の市民について知りたい時によく使用されています。",
            "3": "プロフィールの細かく書くところにはmarked.jsというjavascriptライブラリを使用しました。marked.jsを導入する時には脆弱性であるXSSを「sanitize-html」というライブラリを使用して対策しました。他にもプロフィールの更新と作成の切り替えなどが苦労した点です。",
            "4": "このウェブアプリはゲーム内で使うようなルールや仕事の一覧などの情報を全てまとめています。全ての情報をなるべく見つけやすいようにヘッダーとフッターからアクセスできるようにしています。また、ページの中でタブを切り替えるとurlのidが変わるようにしurl共有もしやすくしています。",
            "5": "このウェブアプリにはスタッフ用コントロールパネルを実装しています。各ページを詳細にカスタマイズできるようにし、更新したいページが出てきた時にスタッフが更新できる仕組みになっています。この機能を導入したことでウェブアプリの開発者が手を加えなくても更新ができるので1番大きな機能だと感じています。"
        }
    },
    {
        "id": 6,
        "name": "<p class=\"text-center\">GMC RP</p><p class=\"text-center\"><span>ステッカー申請</span><span>フォーム</span></p>",
        "each": "<span>GMC RP</span> <span>ステッカー申請</span><span>フォーム</span>",
        "url": "https://www.canva.com/design/DAF2ueSXvjE/EKkSm1QrsPgnWiXC1Ti2Ig/edit?utm_content=DAF2ueSXvjE&utm_campaign=designshare&utm_medium=link2&utm_source=sharebutton",
        "url_name": "発表時に使用したスライド資料",
        "purpose": "高校の課外活動としてありプロジェクトNの特別版で興味のあるメタバースという分野の活動だったため参加しました。メタバースを活用して男木島の関係人口を増やすための企画を考えスライドを作成しプレゼンテーションをしました。",
        "outlook": "NTTさんとケノヒさんという企業の協力のもと企画を考え、その企業さんに対してプレゼンテーションをしたためほぼ実践の形で企画制作能力とスライド制作能力、プレゼンテーション能力が育まれました。",
        "device": {
            "1": "この活動は【関係人口を増やす】【メタバースを活用する】【実現可能性を考える】という難しい内容でした。そのためペルソナからニーズを考える方法を取ったりマンダラート法を使ったりし企画を考案し、定義した課題を解決できる企画ができました。",
            "2": "僕たちのチームでは「メタエデュバース」というメタバース上の家庭教師をするというメタバースの特徴を最大限に活用した企画を考えました。3,4,5枚目の画像で工夫点を記載していますがさらに詳しいスライド資料は画面上部のリンクからご覧いただけます。",
            "3": "企画考案の段階で島の方に話を聞いてみたところ島に高校がない影響で島に高校生がいないという課題があることに気づきました。その課題から高校生と男木島の小中学生が触れ合えるというコンセプトに決定し企画を考えました。",
            "4": "他オンライン家庭教師について調べてみたところ飽きてしまうことが課題だとわかり画像のような飽きないための工夫を施しました。また、この課外活動の目的である関係人口として島に来てもらうために小中学生にリアルであってもらう工夫も施しています。",
            "5": "この活動はIT技術を活用して社会課題を解決するアイデアを考案するという内容であり、貴校のウェブサイトに載ってある使命にピッタリなことをしてきたなと感じました。"
        }
    },
    {
        "id": 7,
        "name": "<p class=\"text-center\">男木島メタバース</p><p class=\"text-center\"><span>構築体験</span><span>プロジェクト</span></p>",
        "each": "<span>男木島メタバース</span><span>構築体験</span><span>プロジェクト</span>",
        "url": "https://www.canva.com/design/DAGc5Y25qzA/4wXaHJxJKtRwcUw5zisLwQ/edit?utm_content=DAGc5Y25qzA&utm_campaign=designshare&utm_medium=link2&utm_source=sharebutton",
        "url_name": "発表時に使用したスライド資料",
        "purpose": "高校の課外活動としてありプロジェクトNの特別版で興味のあるメタバースという分野の活動だったため参加しました。メタバースを活用して男木島の関係人口を増やすための企画を考えスライドを作成しプレゼンテーションをしました。",
        "outlook": "NTTさんとケノヒさんという企業の協力のもと企画を考え、その企業さんに対してプレゼンテーションをしたためほぼ実践の形で企画制作能力とスライド制作能力、プレゼンテーション能力が育まれました。",
        "device": {
            "1": "この活動は【関係人口を増やす】【メタバースを活用する】【実現可能性を考える】という難しい内容でした。そのためペルソナからニーズを考える方法を取ったりマンダラート法を使ったりし企画を考案し、定義した課題を解決できる企画ができました。",
            "2": "僕たちのチームでは「メタエデュバース」というメタバース上の家庭教師をするというメタバースの特徴を最大限に活用した企画を考えました。3,4,5枚目の画像で工夫点を記載していますがさらに詳しいスライド資料は画面上部のリンクからご覧いただけます。",
            "3": "企画考案の段階で島の方に話を聞いてみたところ島に高校がない影響で島に高校生がいないという課題があることに気づきました。その課題から高校生と男木島の小中学生が触れ合えるというコンセプトに決定し企画を考えました。",
            "4": "他オンライン家庭教師について調べてみたところ飽きてしまうことが課題だとわかり画像のような飽きないための工夫を施しました。また、この課外活動の目的である関係人口として島に来てもらうために小中学生にリアルであってもらう工夫も施しています。",
            "5": "この活動はIT技術を活用して社会課題を解決するアイデアを考案するという内容であり、貴校のウェブサイトに載ってある使命にピッタリなことをしてきたなと感じました。"
        }
    },
    {
        "id": 8,
        "name": "<p class=\"text-center\">男木島花火大会</p><p class=\"text-center\">店舗出し</p>",
        "each": "<span>クロスカルチャー</span><span>リデザイン</span>",
        "url": "https://www.canva.com/design/DAFzuaRNJok/_qtR5d3suqUwaB0WF0VOPw/edit?utm_content=DAFzuaRNJok&utm_campaign=designshare&utm_medium=link2&utm_source=sharebutton",
        "url_name": "発表時に使用したスライド資料",
        "purpose": "高校の授業である「プロジェクトN」の活動で制作したものです。多文化共生への配慮が乏しい場所を様々な文化を持つ人にとって使いやすい場所にリデザインするという活動目標で行いました。",
        "outlook": "この活動時、自分のキャンパスの参加人数が少なかったため他キャンパスと合同でzoomを通して行った企画でした。そのためこれから必要になってくると感じているオンラインでの企画制作能力が特に養われました。",
        "device": {
            "1": "この活動は最終発表時に西日本ブロックで1番評価の高かったものになりました。そのため2年間(1年生~2年生)で1番力を入れたプロジェクトN制作だったと感じています。最後まで軸をブラさずに制作を行ってきたことが1番大きい要因だと感じています。",
            "2": "",
            "3": "この制作は少し特殊で軸から考えてみると課題が3つ出てきました。制作時はその3つの課題を常に考えていないとコンセプトに合っている企画を考えれないと感じました。そのため、課題から何をするかを常に考えるようにし、一貫性のある企画を考案することができました。",
            "4": "また、実現可能性という点も考えなければならない企画だったため5W1Hではなく6W3H(What, Who, Whom, Where, When, Why, How, How much, How many)の考え方を重視しました。スライドの全体を通して6W3Hを順番に潰していくようにし発表を見た人の疑問をゼロにする工夫を施しました。",
            "5": "自分自身はチームの中でもスライド制作に力を入れました。大きくわかりやすいスライドにするのはもちろんのこと、細かいグラフも元のスクリーンショットではなく一から作成し、統一感を持たせるよう意識しました。また、引用元もあまり目がいかないぐらいの大きさで記載し情報リテラシー面も完璧にしました。"
        }
    },
    {
        "id": 9,
        "name": "<p class=\"text-center\">高松キャンパス</p><p class=\"text-center\"><span>生徒向け</span><span>ウェブアアプリ</span></p>",
        "each": "<span>高松キャンパス</span><span>生徒向け</span><span>ウェブアプリ</span>",
        "url": "",
        "url_name": "プライベートなウェブアプリのためurlはありません。",
        "purpose": "自分の通っていたキャンパス用で作成したウェブアプリです。作ろうと思ったきっかけは先生からお願いされたという理由もありますが、キャンパスライフが更に充実したものになってほしいという思いもあり制作しました。",
        "outlook": "このウェブアプリは僕が初めてニーズなどを考えながら制作したものです。そのためユーザ目線のことを主に考えながら制作したので将来誰かのために制作する時はどんなジャンルのものでも役に立つと感じています。",
        "device": {
            "1": "展望でも書いたように実際に「こういう機能があるウェブアプリがあったらいいなぁー」などの声を聞きながら制作しました。そのため先生や生徒目線で考えた際に使いやすいUIになるよう意識したので公開後も好評でみんなに使いやすいと言ってもらえているUIにできました。",
            "2": "画像はニュースページです。毎週担当の人がニュースを書くという習慣を先生に作っていただき実際に運用しています。ニュース作成画面も全体のプレビューを表示ができたりmarked.jsでのプレビューを見れたりするのでとても書きやすいUIになっています。",
            "3": "画像はイベントカレンダーのページです。これは決められた生徒のみがイベントの追加ができる権限設定になっていて毎月のイベントを更新してもらっています。また、「みんなの誕生日を祝えるように！」という生徒からの思いで誕生日も自分で設定したら追加されていきます。",
            "4": "GIF画像のページは写真ギャラリーです。(プライバシーの観点から写真は見えなくしています。)このページのUIはこのウェブアプリの中でも1番こだわっていて僕が普段使っているGoogle PhotoのUIを参考にして制作しました。これは誰でもアップロードできる仕組みにしていて画像サイズが大きかったり、画像ファイルじゃなかったらエラーが出るようにもしています。",
            "5": "画像のページは登録した生徒・先生の自己紹介が見れるページです。名前、呼称、学年、一言が一覧でわかるようにしていてそれぞれのページにいくと更に詳しく見れるようになっています。みんな自己紹介をしっかり設定してくれていてとても賑やかな自己紹介ページになっています。"
        }
    },
    // {
    //     "id": 6,
    //     "name": "<p class=\"text-center\"><span>高松キャンパス</span><span>フェスティバル</span></p><p class=\"text-center\">副実行委員長</p>",
    //     "each": "<span>高松キャンパス</span><span>フェスティバル</span><span>副実行委員長</span>",
    //     "url": "https://shino.mods.jp/campus2023/home/",
    //     "url_name": "高松キャンパスフェスティバルウェブサイト",
    //     "purpose": "キャンパスでキャンパスフェスティバルという文化祭に近いイベントがありました。イベントの制作能力を上げたいと思っていたため副実行委員長になりイベント制作をしました。",
    //     "outlook": "制作全体を見て始めてすぐは軸を後回しにしてしまったため制作の前半はうまくいっていませんでしたが、後半でやっと軸を決めてからはスムーズにいきました。この経験から企画制作は軸をしっかり決めてから考えることの大切さを学べました。",
    //     "device": {
    //         "1": "イベント制作時に意識したことはイベント内の企画を作る人の意思を確認することです。Google Formを使ったり、個別で話をしに行くなどをしてうまく意思の疎通ができました。また、展望にも書いているように後半では軸を大切にし統一感のある企画の内容を考えることができました。",
    //         "2": "このイベントは両親が参加可能なため「異世代間交流」と「タイムトラベル」を軸にしていました。そのため軸の意味を入れれる「Takamatsu; Gate 異世代間のインタラクト」というゲームをオマージュしたスローガンにしました。その軸とスローガンを元にウェブサイトや企画を制作したためとても統一感を出すことができました。",
    //         "3": "このキャンパスフェスティバルではタイムテーブルとスローガンを記載されているウェブサイトが必要でした。ウェブサイトを作れる人が僕しかいなかったため、スローガンに合うようなデザインのウェブサイトを作成しました。コンセプトからデザインを考えたのでデザイン面でいうとこれまで作ってきた中で1番の出来です。",
    //         "4": "前日までは直前リハーサルで発覚するような問題があるぐらいには怖いところがいっぱいありましたが、当日は問題にも柔軟に対応できて大大大成功で終わることができました。当日来てくれた僕のお母さんからも「全ての企画が楽しかった。またするなら来たい。」という評価をもらえて嬉しかったです。",
    //         "5": "キャンパスフェスティバルの制作から当日の全てを通してもこれまでにない程楽しかった学校行事だったと感じています。これから、企画制作などをする際はこの楽しかったという経験を活かしていきたいです。"
    //     }
    // }
    // {
    //     "id": 1,
    //     "name": "<p class=\"text-center\">GMC RP</p><p class=\"text-center\">ウェブアプリ</p>",
    //     "each": "<span>GMC RP</span> <span>ウェブアプリ</span>",
    //     "url": "https://www.gmcrp.net/",
    //     "url_name": "gmcrp.net",
    //     "purpose": "GTA5というゲームのサーバー用ウェブアプリケーションです。\r\nGTA5のサーバーの運営をしており、そこで使えるウェブアプリがあると便利だと思い作成しました。",
    //     "outlook": "このサービスは25,000$の売り上げを出しているということもありこれまでで1番本気で取り組んだ制作です。売り上げを出したという経験がこれからどんな制作をする際にも役に立つと思っています。",
    //     "device": {
    //         "1": "これまででも一番規模の大きい4000人に対して公開するウェブアプリになり、脆弱性の観点がとても難しかったです。ですが、「安全なWebアプリケーションの作り方」という本を見ながらコードを書くことでこれまでで一番の出来となるウェブアプリを作ることができました。",
    //         "2": "実際にアクセスしていただくとわかりますが、市民一覧のページには登録された方が設定したプロフィールを見れるようになっています。登録されているユーザ数は9/6の時点で1300人を超えており多くの情報があるため特定の市民について知りたい時によく使用されています。",
    //         "3": "プロフィールの細かく書くところにはmarked.jsというjavascriptライブラリを使用しました。marked.jsを導入する時には脆弱性であるXSSを「sanitize-html」というライブラリを使用して対策しました。他にもプロフィールの更新と作成の切り替えなどが苦労した点です。",
    //         "4": "このウェブアプリはゲーム内で使うようなルールや仕事の一覧などの情報を全てまとめています。全ての情報をなるべく見つけやすいようにヘッダーとフッターからアクセスできるようにしています。また、ページの中でタブを切り替えるとurlのidが変わるようにしurl共有もしやすくしています。",
    //         "5": "このウェブアプリにはスタッフ用コントロールパネルを実装しています。各ページを詳細にカスタマイズできるようにし、更新したいページが出てきた時にスタッフが更新できる仕組みになっています。この機能を導入したことでウェブアプリの開発者が手を加えなくても更新ができるので1番大きな機能だと感じています。"
    //     }
    // },
]